{"Grand Prix":[

  {"Spain": {
    "Name": "Spain Pre-Season Testing",
    "Date":"February 23-25",
    "Round":"Testing"
  }

  },

  {"Bahrain": {
    "Name": "Bahrain Pre-Season Testing",
    "Date":"March 10-12",
    "Round":"Testing"
  }

  },


  {"Bahrain": {
    "Name": "Bahrain Grand Prix",
    "Desc": "",
    "Date":"March 18-20",
    "Round":"Round 1",
    "1st Place": "Charles Leclerc",
    "2nd PLace": "Carlos Sainz",
    "3rd Place": "Lewis Hamilton"
  }

  },



  {"Saudi Arabia": {
    "Name": "Saudi Arabian Grand Prix",
    "Date":"March 25-27",
    "Round":"Round 2",
    "1st Place": "Max Verstappen",
    "2nd PLace": "Charles Leclerc",
    "3rd Place": "Carlos Sainz"
  }

  },


  {"Austrailia": {
    "Name": "Austrailian Grand Prix",
    "Desc": "The Australian Grand Prix is an annual motor racing event which is under contract to host Formula One until 2025.[1] It is the second oldest surviving motor racing competition held in Australia, after the Alpine rally of East Gippsland. The Grand Prix has moved frequently with 23 different venues having been used since it was first run at Phillip Island in 1928",
    "Date":"April 8-10",
    "Round":"Round 3",
    "1st Place": "Charles Leclerc",
    "2nd PLace": "Sergio Perez",
    "3rd Place": "George Russel"
  }

  },


  {"Italy": {
    "Name": "Italian Grand Prix",
    "Desc": "The Italian Grand Prix is the fifth oldest national Grand Prix (after the French Grand Prix, the American Grand Prize, the Spanish Grand Prix and the Russian Grand Prix), having been held since 1921. In 2013 it became the most held Grand Prix (the 2021 edition was the 91st). It is one of the two Grands Prix (along with the British) which has run as an event of the Formula One World Championship Grands Prix every season, continuously since the championship was introduced in 1950. Every Formula One Italian Grand Prix in the World Championship era has been held at Monza except in 1980, when it was held at Imola",
    "Date":"April 22-24",
    "Round":"Round 4"
  }

  },


  {"United States": {
    "Name": "US Grand Prix",
    "Desc": "The United States Grand Prix is a motor racing event that has been held on and off since 1908, when it was known as the American Grand Prize. The Grand Prix later became part of the Formula One World Championship. As of 2021, the Grand Prix has been held 50 times, and it has taken place at ten different locations in total. Since 2012, it has been held every year at the Circuit of the Americas in Austin, Texas, with the exception of 2020 when it was cancelled due to the COVID-19 pandemic in the United States. ",
    "Date":"May 8-10",
    "Round":"Round 5"
  }

  },


  {"Spain": {
    "Name": "Spanish Grand Prix",
    "Desc": " is a Formula One motor racing event currently held at the Circuit de Barcelona-Catalunya. The race is one of the oldest in the world still contested, celebrating its centenary in 2013. The race had modest beginnings as a production car race. Interrupted by the First World War, the race waited a decade for its second running before becoming a staple of the European calendar.",
    "Date":"May 22-25",
    "Round":"Round 6"
  }

  },

  {"Monaco": {
    "Name": "Monaco Grand Prix",
    "Desc": "is a Formula One motor racing event held annually on the Circuit de Monaco, in late May or early June. Run since 1929, it is widely considered to be one of the most important and prestigious automobile races in the world,[2][3][4] and is one of the races—along with the Indianapolis 500 and the 24 Hours of Le Mans—that form the Triple Crown of Motorsport.[5] The circuit has been called \"an exceptional location of glamour and prestige\".",
    "Date":"May 27-29",
    "Round":"Round 7"
  }

  },

  {"Azerbaijan": {
    "Name": "Azerbaijan Grand Prix",
    "Desc": "The first Formula One Grand Prix to be held in Azerbaijan was the 2016 European Grand Prix, which took place at the Baku City Circuit. A year later, in 2017, the same venue hosted the first Azerbaijan Grand Prix. The race was held on 25 June and was one of five races to be held on a street circuit during the 2017 Formula One season, along with the Singapore, Monaco, Australian and Canadian Grands Prix. The first Azerbaijan Grand Prix winner was Daniel Ricciardo of Red Bull",
    "Date":"June 10-12",
    "Round":"Round 8"
  }

  },

  {"Canada": {
    "Name": "Canada Grand Prix",
    "Desc": "The Canadian Grand Prix (French: Grand Prix du Canada) is an annual motor racing event held since 1961. It has been part of the Formula One World Championship since 1967. It was first staged at Mosport Park in Bowmanville, Ontario, as a sports car event, before alternating between Mosport and Circuit Mont-Tremblant, Quebec, after Formula One took over the event.",
    "Date":"June 17-19",
    "Round":"Round 9"
  }

  },

  {"Great Britain": {
    "Name": "Silverstone Grand Prix",
    "Desc": "The British Grand Prix is a Grand Prix motor race organised in the United Kingdom by the Royal Automobile Club. First held in 1926, the British Grand Prix has been held annually since 1948 and has been a round of the FIA Formula One World Championship every year since 1950.",
    "Date":"July 1-3",
    "Round":"Round 10"
  }

  },

  {"Austria": {
    "Name": "Austrian Grand Prix",
    "Date":"July 8-10",
    "Round":"Round 11"
  }

  },

  {"France": {
    "Name": "French Grand Prix",
    "Date":"July 22-24",
    "Round":"Round 12"
  }

  },

  {"Hungary": {
    "Name": "Hungarian Grand Prix",
    "Desc": "The Hungarian Grand Prix is a motor racing event held annually in Mogyoród. Since 1986, the race has been a round of the FIA Formula One World Championship. ",
    "Date":"July 29-31",
    "Round":"Round 13"
  }

  },

  {"Belgium": {
    "Name": "Belgium Grand Prix",
    "Desc": "The Belgium Grand Prix is a motor racing event which forms part of the Formula One World Championship. The first national race of Belgium was held in 1925 at the Spa region's race course, an area of the country that had been associated with motor sport since the very early years of racing",
    "Date":"August 26-28",
    "Round":"Round 14"

  }

  },

  {"Netherlands": {
    "Name": "Dutch Grand Prix",
    "Date":"September 2-4",
    "Round":"Round 15"
  }

  },

  {"Italy": {
    "Name": "Italian Grand Prix",
    "Desc": "The Italian Grand Prix is the fifth oldest national Grand Prix (after the French Grand Prix, the American Grand Prize, the Spanish Grand Prix and the Russian Grand Prix), having been held since 1921. In 2013 it became the most held Grand Prix (the 2021 edition was the 91st). It is one of the two Grands Prix (along with the British) which has run as an event of the Formula One World Championship Grands Prix every season, continuously since the championship was introduced in 1950. Every Formula One Italian Grand Prix in the World Championship era has been held at Monza except in 1980, when it was held at Imola\",",
    "Date":"September 9-11",
    "Round":"Round 16"
  }

  },

  {"Singapore": {
    "Name": "Singapore Grand Prix",
    "Desc": "The Singapre Grand Prix is a motor racing event which forms part of the Formula One World Championship. The event takes place on the Marina Bay Street Circuit and was the inaugural night race and first street circuit in Asia designed for Formula One races",
    "Date":"September-October 30-02",
    "Round":"Round 17"
  }

  },


  {"Japan": {
    "Name": "Japanese Grand Prix",
    "Desc": "The Japanese Grand Prix is a motor racing event in the calendar of the Formula One World Championship. Historically, Japan has been one of the last races of the season, and as such the Japanese Grand Prix has been the venue for many title-deciding races, with 13 World Champions being crowned over the 34 World Championship Japanese Grands Prix that have been hosted. Japan was the only Asian nation to host a Formula One race (including the Pacific Grand Prix) until Malaysia joined the calendar in 1999. ",
    "Date":"May 7-9",
    "Round":"Round 18"

  }

  },

  {"United States": {
    "Name": "US Grand Prix",
    "Desc": "The United States Grand Prix is a motor racing event that has been held on and off since 1908, when it was known as the American Grand Prize. The Grand Prix later became part of the Formula One World Championship. As of 2021, the Grand Prix has been held 50 times, and it has taken place at ten different locations in total. Since 2012, it has been held every year at the Circuit of the Americas in Austin, Texas, with the exception of 2020 when it was cancelled due to the COVID-19 pandemic in the United States. ",
    "Date":"October 21-23",
    "Round":"Round 19"

  }

  },

  {"Mexico": {
    "Name": "Mexican Grand Prix",
    "Desc": "The Mexican Grand Prix is currently held under the name Mexico City Grand Prix (Spanish: Gran Premio de la Ciudad de México), is a motor racing event held at the Autódromo Hermanos Rodríguez in Mexico City. It first appeared as a non-championship event in 1962 before being held as a championship event in 1963–1970 and 1986–1992. The Grand Prix returned in 2015 at the Mexico City circuit. ",
    "Date":"October 28-30",
    "Round":"Round 20"
  }

  },

  {"Brasil": {
    "Name": "Brasilian Grand Prix",
    "Desc": "The Brasilian Grand Prix currently held under the name São Paulo Grand Prix (Portuguese: Grande Prêmio de São Paulo), is a Formula One championship race which is currently held at the Autódromo José Carlos Pace in Interlagos neighborhood, Cidade Dutra, São Paulo. ",
    "Date":"November 11-13",
    "Round":"Round 21"
  }

  },


  {"Abu Dhabi": {
    "Name": "Abu Dhabi Grand Prix",
    "Desc": "s a Formula One motor racing event. It was announced in early 2007 at the Abu Dhabi F1 Festival in the United Arab Emirates. The first race took place on 1 November 2009, held at the Hermann Tilke designed Yas Marina Circuit.",
    "Date":"November 18-20",
    "Round":"Round 22"
  }

  }

]}